# オブジェクト指向とは
# オブジェクト指向とは、設計図から物を生み出すという考え方のこと
# なぜこのような考え方をプログラミングに取り入れるのかというと、単純に開発効率が上がるから
# プログラムの世界では、設計図のことを クラス 、設計図から生み出された物のことを インスタンス（またはオブジェクト） という

# オブジェクト指向を取り入れるメリット
# ・設計図（クラス）を使いまわすことができる（コードを沢山書かなくて済む）
# ・物（インスタンス）の質を一定に保つことができる（エラーの発生率を下げることができる）
# ・物（インスタンス）のカスタマイズがしやすい（コードを書き換える量が少なくて済む）

# インスタンスの種類
# クラス	説明	例
# String	文字を表す（文字列）	"文字列"
# Integer	整数を扱う（整数）	33
# Float	少数を扱う（少数）	1.5
# Array	複数のデータを格納して一度にたくさんのデータを扱うことができる（配列）	["tanaka","saitou","aoyagi"]
# Hash	キーとバリューの組み合わせでデータを扱う（ハッシュ）	{name: "tanaka", age: 33, hobby: "soccer"}

